MikroElektronika/core_packages/ARM/gcc_clang/system/src/infineon/cy8c4147azs_s5/thirdparty/cy8c4147azs_s5/ip/cyip_canfd_v2.h
/* CANFD_CH.RXFTOP_CTL */
#define CANFD_CH_RXFTOP_CTL_F0TPE_Pos           0UL
#define CANFD_CH_RXFTOP_CTL_F0TPE_Msk           0x1UL
#define CANFD_CH_RXFTOP_CTL_F1TPE_Pos           1UL
#define CANFD_CH_RXFTOP_CTL_F1TPE_Msk           0x2UL
/* CANFD_CH.RXFTOP0_STAT */
#define CANFD_CH_RXFTOP0_STAT_F0TA_Pos          0UL
#define CANFD_CH_RXFTOP0_STAT_F0TA_Msk          0xFFFFUL
/* CANFD_CH.RXFTOP0_DATA */
#define CANFD_CH_RXFTOP0_DATA_F0TD_Pos          0UL
#define CANFD_CH_RXFTOP0_DATA_F0TD_Msk          0xFFFFFFFFUL
/* CANFD_CH.RXFTOP1_STAT */
#define CANFD_CH_RXFTOP1_STAT_F1TA_Pos          0UL
#define CANFD_CH_RXFTOP1_STAT_F1TA_Msk          0xFFFFUL
/* CANFD_CH.RXFTOP1_DATA */
#define CANFD_CH_RXFTOP1_DATA_F1TD_Pos          0UL
#define CANFD_CH_RXFTOP1_DATA_F1TD_Msk          0xFFFFFFFFUL


/* CANFD.CTL */
#define CANFD_CTL_STOP_REQ_Pos                  0UL
#define CANFD_CTL_STOP_REQ_Msk                  0xFFUL
#define CANFD_CTL_MRAM_OFF_Pos                  31UL
#define CANFD_CTL_MRAM_OFF_Msk                  0x80000000UL
/* CANFD.STATUS */
#define CANFD_STATUS_STOP_ACK_Pos               0UL
#define CANFD_STATUS_STOP_ACK_Msk               0xFFUL
/* CANFD.INTR0_CAUSE */
#define CANFD_INTR0_CAUSE_INT0_Pos              0UL
#define CANFD_INTR0_CAUSE_INT0_Msk              0xFFUL
/* CANFD.INTR1_CAUSE */
#define CANFD_INTR1_CAUSE_INT1_Pos              0UL
#define CANFD_INTR1_CAUSE_INT1_Msk              0xFFUL
/* CANFD.TS_CTL */
#define CANFD_TS_CTL_PRESCALE_Pos               0UL
#define CANFD_TS_CTL_PRESCALE_Msk               0xFFFFUL
#define CANFD_TS_CTL_ENABLED_Pos                31UL
#define CANFD_TS_CTL_ENABLED_Msk                0x80000000UL
/* CANFD.TS_CNT */
#define CANFD_TS_CNT_VALUE_Pos                  0UL
#define CANFD_TS_CNT_VALUE_Msk                  0xFFFFUL
/* CANFD.ECC_CTL */
#define CANFD_ECC_CTL_ECC_EN_Pos                16UL
#define CANFD_ECC_CTL_ECC_EN_Msk                0x10000UL
/* CANFD.ECC_ERR_INJ */
#define CANFD_ECC_ERR_INJ_ERR_ADDR_Pos          2UL
#define CANFD_ECC_ERR_INJ_ERR_ADDR_Msk          0xFFFCUL
#define CANFD_ECC_ERR_INJ_ERR_EN_Pos            20UL
#define CANFD_ECC_ERR_INJ_ERR_EN_Msk            0x100000UL
#define CANFD_ECC_ERR_INJ_ERR_PAR_Pos           24UL
#define CANFD_ECC_ERR_INJ_ERR_PAR_Msk           0x7F000000UL


#endif /* _CYIP_CANFD_V2_H_ */


/* [] END OF FILE */
